package test.main;

public class MainClassQuiz {
	public static void main(String[] args) {
		/*
		 * Quiz
		 * 
		 * [ Step 05 ] 
		 * 
		 * MyObject클래스에 정의된 3개의 메소드를 차례로 호출하는 code를 작성하세요.
		 * .setNum(), .setName(), .uesCar() 메소드를 호출하세요.
		 * 
		 * useSome(), doSome() 메소드 호출하세요.
		 * 
		 * test.mypac 패키지에 다양한 모양의 메소드를 가지는 클래스를 정의하고
		 * 그 클래스를 이용해서 객체도 생성하고 메소드도 호출하세요.
		 * 
		 * Messenger 클래스의 static 메소드 3개를 하나씩 호출해보세요.
		 * 
		 * 
		 * [ Step 06 ]
		 * 
		 * Car 클래스로 객체를 생성해서 참조값을 c1이라는 이름의 변수에 담기.
		 * c1에 담겨있는 참조값을 이용해서 .drive() 메소드를 호출
		 * 
		 * Q1. 프로그래밍의 목적: 무작위 정수를 얻어서 콘솔창에 출력.
		 * 
		 * Q2. 원하는 범위 내에서 정수값을 얻어서 콘솔창에 출력
		 * 		( 범위: 1~45 ) 
		 * 
		 * 생성자 오버라이드(다양한 type의 생성자) 호출, 참조값 지역변수에 담기
		 * 
		 * 
		 * [ Step 07 ]
		 * 기본 data type의 참조 data type 확인
		 * 
		 * 
		 * [ Step 08 ]
		 * 
		 * 0으로 초기화된 방 3개짜리 int[] 객체 만들어서 참조값을 지역변수 nums에 담기
		 * String type의 크기가 3인 빈 배열객체를 만들어서 참조값 지역변수 names에 담기
		 * 
		 * 1. Bike 객체를 담을 수 있는 방 3개짜리 배열 객체를 생성해서 참조값을 
		 * 		bikes라는 지역변수에 담아보세요.
		 * 2. 배열의 각각의 방(0, 1, 2)에 Bike객체를 생성해서 담아보세요.
		 * 3. 반복문 for를 이용해서 배열의 각 방에 있는 Bike객체의 ride()메소드를 호출하세요.
		 * 
		 * 
		 * 1. Rect 객체를 담을 수 있는 방 3개짜리 배열객체를 생성해서
		 * 		참조값을 rects라는 지역변수에 담기
		 * 
		 * 2. 배열에 Rect 객체 3개를 순서대로 담기
		 * 
		 * 3. for문을 이용해서 각각 4각형의 면적을 콘솔창에 출력해보세요.
		 * 
		 * */
	}
}
